public/ephemeris/2025-07-03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-org09f8af3" class="outline-2">
<h2 id="org09f8af3">2025-07-03 - Willkommen in Linz</h2>
<div class="outline-text-2" id="text-org09f8af3">
<p>
Today is my first day in Linz Austria, I will be staying here for two
months to work for a tech company. This opportunity was somewhat
unexpected since I was not actively looking to go abroad, but then the
opportunity came and I decided to go with it.
</p>

<p>
This experience has great personal value for me. First of all, I will
be working in the industry I want to build a career in; I can finally
step out of the University bubble and see what a real day to day job
looks like. Further, I get paid for this so I can be financially
independent which is important.
</p>

<p>
Moreover, I want to see how I handle myself in a completely new
environment. I have been living alone already for three years but I
got used to my life in Trento, I enjoyed quite a stable situation and
it has been a while since I had great changes in my life.
</p>

<p>
I also don't know German, which means I have to translate everything
when I go out since the city does not put much effort helping you. As
soon as I moved in to my building, I had to fill a document with
details about myself for the immigration center; the document was in
German so it took me a while to understand everything that I needed to
write, thankfully it was not too difficult and I asked another person
to review my understanding of the words. Still, why would a document
that immigrants need to sing be in German? English is the universally
known language and chances are that people from other countries know
English. Maybe there is some policy regarding official documents, but
I think this is not helping the person that wants to enter the
country.
</p>

<p>
Once I had the document signed, I needed to bring it to a local
library where I would be registered in the country. The local library
then pointed me to go to the center in the Magistrate, which pointed
me to go to room 1109 where they handled the registration. I have to
say that everything was really fast and the people I talked to knew
where to send me.
</p>

<p>
What was.. unusual.. was how many young people I met during this
process, and while moving. The people I talked to in the Magistrate
were really young, I'd say between 21 and 25 except one which was
older. Even the girl at the city library, and the people in the
tram. This makes me sad seeing that in Italy all the young people are
fleeing the country and who's left are mostly elderly people.
</p>

<p>
Later, I bought my lunch at Eurospar and took a nap. I needed to buy
more things but then it started raining really heavily so I went to a
closer store and bought just the dinner. Even if the trip was a few
hundred meters, my pants and shoes got completely wet, thankfully
there is a dryer I can use in the building. Tomorrow I'll go to a
second hand shop and buy some plates and things to cook at a cheap
price (hopefully) so I can start cooking by myself.
</p>

<p>
I need some sleep now, the previous night I could not sleep at all in
the bus. Yet flixbusses are really nice, I payed a fraction of what I
would have payed if I were to go by train or plane.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
